"""
Условие:
Требуется написать программу, которая печатает все цвета радуги на русском языке.
Каждый цвет вывести в отдельной строке с большой буквы.
"""

colors = ["Красный","Оранжевый","Желтый","Зеленый","Голубой","Синий","Фиолетовый"]
for color in colors:
    print(color)