"""


Условие:
Пусть задана некоторая матрица.Требуется написать программу, выполняющую поворот этой матрицы по часовой
стрелке k ∈ Z раз.При k < 0 такой поворот эквивалентен повороту против часовой стрелки | k | раз. В задаче
запрещено пользоваться какими - либо пакетами. Формат входных данных Первая строка входного файла содержит
натуральные числа n , m , k — количество строк, столбцов и поворотов.В каждой их следующих n строк содержится по m
натуральных чисел — значения элементов матрицы. Формат выходных данных Выходной файл должен содержать повернутую
матрицу.Каждая строка матрицы записывается в отдельной строке, при этом элементы разделены символом "пробел",
аналогично входным данным.

"""